Repository: samuelAriza/HireLoop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Exact paths (files or directories) to include in filtered history. Multiple --path options can be specified to get a union of paths.
es: Rutas exactas (archivos o directorios) para incluir en el historial filtrado. Se pueden especificar múltiples opciones --path para obtener una unión de rutas.

source: Glob of paths to include in filtered history. Multiple --path-glob options can be specified to get a union of paths.
es: Glob de rutas para incluir en el historial filtrado. Se pueden especificar múltiples opciones --path-glob para obtener una unión de rutas.

source: Regex of paths to include in filtered history. Multiple --path-regex options can be specified to get a union of paths
es: Expresión regular de rutas para incluir en el historial filtrado. Se pueden especificar múltiples opciones --path-regex para obtener una unión de rutas.

source: Match on file base name instead of full path from the top of the repo. Incompatible with --path-rename, and incompatible with matching against directory names.
es: Coincidir con el nombre base del archivo en lugar de la ruta completa desde la raíz del repositorio. Incompatible con --path-rename e incompatible con la coincidencia contra nombres de directorios.

source: Renaming based on paths (see also --filename-callback)
es: Renombrado basado en rutas (ver también --filename-callback)

source: Path to rename; if filename or directory matches OLD_NAME rename to NEW_NAME. Multiple --path-rename options can be specified. NOTE: If you combine filtering options with renaming ones, do not rely on a rename argument to select paths; you also need a filter to select them.
es: Ruta a renombrar; si el nombre de archivo o directorio coincide con OLD_NAME, renombrar a NEW_NAME. Se pueden especificar múltiples opciones --path-rename. NOTA: Si combinas opciones de filtrado con las de renombrado, no confíes en un argumento de renombrado para seleccionar rutas; también necesitas un filtro para seleccionarlas.

source: Path shortcuts
es: Atajos de ruta

source: Specify several path filtering and renaming directives, one per line. Lines with '==>' in them specify path renames, and lines can begin with 'literal:' (the default), 'glob:', or 'regex:' to specify different matching styles. Blank lines and lines starting with a '#' are ignored.
es: Especifique varias directivas de filtrado y renombrado de rutas, una por línea. Las líneas que contienen '==>' especifican renombrados de rutas, y las líneas pueden comenzar con 'literal:' (el valor predeterminado), 'glob:' o 'regex:' para especificar diferentes estilos de coincidencia. Se ignoran las líneas en blanco y las líneas que comienzan con '#'.

source: Only look at history that touches the given subdirectory and treat that directory as the project root. Equivalent to using '--path DIRECTORY/ --path-rename DIRECTORY/:'
es: Solo mire el historial que afecta al subdirectorio dado y trate ese directorio como la raíz del proyecto. Equivalente a usar '--path DIRECTORY/ --path-rename DIRECTORY/:'

source: Treat the project root as if it were under DIRECTORY. Equivalent to using '--path-rename :DIRECTORY/'
es: Trate la raíz del proyecto como si estuviera bajo DIRECTORY. Equivalente a usar '--path-rename :DIRECTORY/'

source: Content editing filters (see also --blob-callback)
es: Filtros de edición de contenido (ver también --blob-callback)

source: A file with expressions that, if found, will be replaced. By default, each expression is treated as literal text, but 'regex:' and 'glob:' prefixes are supported. You can end the line with '==>' and some replacement text to choose a replacement choice other than the default of '{}'.
es: Un archivo con expresiones que, si se encuentran, serán reemplazadas. Por defecto, cada expresión se trata como texto literal, pero se admiten los prefijos 'regex:' y 'glob:'. Puede terminar la línea con '==>' y algún texto de reemplazo para elegir una opción de reemplazo distinta al valor predeterminado de '{}'.

source: Strip blobs (files) bigger than specified size (e.g. '5M', '2G', etc)
es: Eliminar blobs (archivos) mayores que el tamaño especificado (por ejemplo, '5M', '2G', etc.)

source: Read git object ids from each line of the given file, and strip all of them from history
es: Leer IDs de objetos git de cada línea del archivo dado y eliminar todos ellos del historial

source: Renaming of refs (see also --refname-callback)
es: Renombrado de referencias (ver también --refname-callback)

source: Rename tags starting with OLD to start with NEW. For example, --tag-rename foo:bar will rename tag foo-1.2.3 to bar-1.2.3; either OLD or NEW can be empty.
es: Renombrar etiquetas que comienzan con OLD para que comiencen con NEW. Por ejemplo, --tag-rename foo:bar renombrará la etiqueta foo-1.2.3 a bar-1.2.3; OLD o NEW pueden estar vacíos.

source: Filtering of commit messages (see also --message-callback)
es: Filtrado de mensajes de commit (ver también --message-callback)

source: A file with expressions that, if found in commit or tag messages, will be replaced. This file uses the same syntax as --replace-text.
es: Un archivo con expresiones que, si se encuentran en mensajes de commit o etiquetas, serán reemplazadas. Este archivo usa la misma sintaxis que --replace-text.

source: By default, since commits are rewritten and thus gain new hashes, references to old commit hashes in commit messages are replaced with new commit hashes (abbreviated to the same length as the old reference). Use this flag to turn off updating commit hashes in commit messages.
es: Por defecto, dado que los commits se reescriben y por lo tanto obtienen nuevos hashes, las referencias a hashes antiguos de commits en los mensajes de commit se reemplazan con nuevos hashes de commit (abreviados a la misma longitud que la referencia antigua). Use esta opción para desactivar la actualización de hashes de commit en los mensajes de commit.

source: Do not reencode commit messages into UTF-8. By default, if the commit object specifies an encoding for the commit message, the message is re-encoded into UTF-8.
es: No volver a codificar los mensajes de commit en UTF-8. Por defecto, si el objeto commit especifica una codificación para el mensaje del commit, el mensaje se vuelve a codificar en UTF-8.

source: Filtering of names & emails (see also --name-callback and --email-callback)
es: Filtrado de nombres y correos electrónicos (ver también --name-callback y --email-callback)

source: Use specified mailmap file (see git-shortlog(1) for details on the format) when rewriting author, committer, and tagger names and emails. If the specified file is part of git history, historical versions of the file will be ignored; only the current contents are consulted.
es: Usar el archivo mailmap especificado (ver git-shortlog(1) para detalles sobre el formato) al reescribir nombres y correos electrónicos de autor, committer y tagger. Si el archivo especificado forma parte de la historia de git, las versiones históricas del archivo serán ignoradas; solo se consultan los contenidos actuales.

source: Same as: '--mailmap .mailmap'
es: Igual que: '--mailmap .mailmap'

source: Parent rewriting
es: Reescritura de padres

source: How to handle replace refs (see git-replace(1)). Replace refs can be added during the history rewrite as a way to allow users to pass old commit IDs (from before git-filter-repo was run) to git commands and have git know how to translate those old commit IDs to the new (post-rewrite) commit IDs. Also, replace refs that existed before the rewrite can either be deleted or updated. The choices to pass to --replace-refs thus need to specify both what to do with existing refs and what to do with commit rewrites. Thus 'update-and-add' means to update existing replace refs, and for any commit rewrite (even if already pointed at by a replace ref) add a new refs/replace/ reference to map from the old commit ID to the new commit ID. The default is update-no-add, meaning update existing replace refs but do not add any new ones. There is also a special 'old-default' option for picking the default used in versions prior to git-filter-repo-2.45, namely 'update-and-add' upon the first run of git-filter-repo in a repository and 'update-or-add' if running git-filter-repo again on a repository.
es: Cómo manejar las referencias de reemplazo (ver git-replace(1)). Las referencias de reemplazo pueden añadirse durante la reescritura del historial como una forma de permitir a los usuarios pasar IDs de commit antiguos (de antes de ejecutar git-filter-repo) a comandos git y que git sepa cómo traducir esos IDs antiguos a los nuevos (post-reescritura). Además, las referencias de reemplazo que existían antes de la reescritura pueden ser eliminadas o actualizadas. Por lo tanto, las opciones para pasar a --replace-refs deben especificar tanto qué hacer con las referencias existentes como qué hacer con las reescrituras de commit. Así, 'update-and-add' significa actualizar las referencias de reemplazo existentes y, para cualquier reescritura de commit (incluso si ya está apuntada por una referencia de reemplazo), añadir una nueva referencia refs/replace/ para mapear del ID de commit antiguo al nuevo. El valor por defecto es update-no-add, que significa actualizar las referencias de reemplazo existentes pero no añadir nuevas. También existe una opción especial 'old-default' para elegir el valor por defecto usado en versiones anteriores a git-filter-repo-2.45, a saber, 'update-and-add' en la primera ejecución de git-filter-repo en un repositorio y 'update-or-add' si se ejecuta git-filter-repo nuevamente en un repositorio.

source: Whether to prune empty commits. 'auto' (the default) means only prune commits which become empty (not commits which were empty in the original repo, unless their parent was pruned). When the parent of a commit is pruned, the first non-pruned ancestor becomes the new parent.
es: Si se deben podar los commits vacíos. 'auto' (el valor predeterminado) significa podar solo los commits que se vuelven vacíos (no los commits que ya estaban vacíos en el repositorio original, a menos que su padre haya sido podado). Cuando se poda el padre de un commit, el primer ancestro no podado se convierte en el nuevo padre.

source: Since merge commits are needed for history topology, they are typically exempt from pruning. However, they can become degenerate with the pruning of other commits (having fewer than two parents, having one commit serve as both parents, or having one parent as the ancestor of the other.) If such merge commits have no file changes, they can be pruned. The default ('auto') is to only prune empty merge commits which become degenerate (not which started as such).
es: Dado que los commits de fusión son necesarios para la topología del historial, normalmente están exentos de poda. Sin embargo, pueden volverse degenerados con la poda de otros commits (tener menos de dos padres, que un commit sirva como ambos padres, o que un padre sea ancestro del otro). Si dichos commits de fusión no tienen cambios en archivos, pueden ser podados. El valor predeterminado ('auto') es podar solo los commits de fusión vacíos que se vuelven degenerados (no los que comenzaron así).

source: Even if the first parent is or becomes an ancestor of another parent, do not prune it. This modifies how --prune-degenerate behaves, and may be useful in projects who always use merge --no-ff.
es: Incluso si el primer padre es o se convierte en ancestro de otro padre, no lo podes. Esto modifica el comportamiento de --prune-degenerate y puede ser útil en proyectos que siempre usan merge --no-ff.

source: Generic callback code snippets
es: Fragmentos genéricos de código para callbacks

source: Python code body for processing filenames; see CALLBACKS sections below.
es: Cuerpo de código Python para procesar nombres de archivos; ver las secciones CALLBACKS a continuación.

source: Python code body for processing file and metadata; see CALLBACKS sections below.
es: Cuerpo de código Python para procesar archivos y metadatos; ver las secciones CALLBACKS a continuación.

source: Python code body for processing messages (both commit messages and tag messages); see CALLBACKS section below.
es: Cuerpo de código Python para procesar mensajes (tanto mensajes de commit como de etiquetas); ver la sección CALLBACKS a continuación.

source: Python code body for processing names of people; see CALLBACKS section below.
es: Cuerpo de código Python para procesar nombres de personas; ver la sección CALLBACKS a continuación.

source: Python code body for processing emails addresses; see CALLBACKS section below.
es: Cuerpo de código Python para procesar direcciones de correo electrónico; ver la sección CALLBACKS a continuación.

source: Python code body for processing refnames; see CALLBACKS section below.
es: Cuerpo de código Python para procesar nombres de referencia; ver la sección CALLBACKS a continuación.

source: Python code body for processing blob objects; see CALLBACKS section below.
es: Cuerpo de código Python para procesar objetos blob; ver la sección CALLBACKS a continuación.

source: Python code body for processing commit objects; see CALLBACKS section below.
es: Cuerpo de código Python para procesar objetos commit; ver la sección CALLBACKS a continuación.

source: Python code body for processing tag objects. Note that lightweight tags have no tag object and are thus not handled by this callback. See CALLBACKS section below.
es: Cuerpo de código Python para procesar objetos de etiqueta. Nota que las etiquetas ligeras no tienen objeto de etiqueta y por lo tanto no son manejadas por este callback. Ver la sección CALLBACKS a continuación.

source: Python code body for processing reset objects; see CALLBACKS section below.
es: Cuerpo de código Python para procesar objetos reset; ver la sección CALLBACKS a continuación.

source: Sensitive Data Removal Handling
es: Manejo de eliminación de datos sensibles

source: This rewrite is intended to remove sensitive data from a repository. Gather extra information from the rewrite needed to provide additional instructions on how to clean up other copies.
es: Esta reescritura está destinada a eliminar datos sensibles de un repositorio. Recoja información adicional de la reescritura necesaria para proporcionar instrucciones adicionales sobre cómo limpiar otras copias.

source: By default, --sensitive-data-removal will trigger a mirror-like fetch of all refs from origin, discarding local changes, but ensuring that _all_ fetchable refs that hold on to the sensitve data are rewritten. This flag removes that fetch, risking that other refs continue holding on to the sensitive data. This option is implied by --partial or any flag that implies --partial.
es: Por defecto, --sensitive-data-removal activará una obtención tipo espejo de todas las referencias desde el origen, descartando cambios locales, pero asegurando que _todas_ las referencias obtenibles que contienen los datos sensibles sean reescritas. Esta opción elimina esa obtención, arriesgando que otras referencias continúen manteniendo los datos sensibles. Esta opción está implícita por --partial o cualquier bandera que implique --partial.

source: Specifying alternate source or target locations implies --partial, except that the normal default for --replace-refs is used. However, unlike normal uses of --partial, this doesn't risk mixing old and new history since the old and new histories are in different repositories.
es: Especificar ubicaciones alternativas de origen o destino implica --partial, excepto que se usa el valor predeterminado normal para --replace-refs. Sin embargo, a diferencia de los usos normales de --partial, esto no arriesga mezclar historia antigua y nueva ya que las historias antigua y nueva están en repositorios diferentes.

source: Location to filter from/to
es: Ubicación desde/hacia la que filtrar

source: Git repository to read from
es: Repositorio Git desde el cual leer

source: Git repository to overwrite with filtered history
es: Repositorio Git para sobrescribir con el historial filtrado

source: Ordering of commits
es: Ordenación de los commits

source: Processes commits in commit timestamp order.
es: Procesa los commits en orden de marca de tiempo del commit.

source: Miscellaneous options
es: Opciones misceláneas

source: Show this help message and exit.
es: Mostrar este mensaje de ayuda y salir.

source: Display filter-repo's version and exit.
es: Mostrar la versión de filter-repo y salir.

source: Avoid triggering the no-arguments-specified check.
es: Evitar activar la comprobación de que no se especificaron argumentos.

source: Rewrite repository history even if the current repo does not look like a fresh clone. History rewriting is irreversible (and includes immediate pruning of reflogs and old objects), so be cautious about using this flag.
es: Reescribir el historial del repositorio incluso si el repositorio actual no parece un clon nuevo. La reescritura del historial es irreversible (e incluye la poda inmediata de reflogs y objetos antiguos), así que tenga precaución al usar esta opción.

source: Do a partial history rewrite, resulting in the mixture of old and new history. This disables rewriting refs/remotes/origin/* to refs/heads/*, disables removing of the 'origin' remote, disables removing unexported refs, disables expiring the reflog, and disables the automatic post-filter gc. Also, this modifies --tag-rename and --refname-callback options such that instead of replacing old refs with new refnames, it will instead create new refs and keep the old ones around. Use with caution.
es: Realizar una reescritura parcial del historial, resultando en una mezcla de historia antigua y nueva. Esto deshabilita la reescritura de refs/remotes/origin/* a refs/heads/*, deshabilita la eliminación del remoto 'origin', deshabilita la eliminación de referencias no exportadas, deshabilita la expiración del reflog y deshabilita la recolección de basura automática posterior al filtro. Además, modifica las opciones --tag-rename y --refname-callback de modo que en lugar de reemplazar referencias antiguas con nuevos nombres, creará nuevas referencias y mantendrá las antiguas. Usar con precaución.

source: Do not run 'git gc' after filtering.
es: No ejecutar 'git gc' después del filtrado.

source: Limit history rewriting to the specified refs. Implies --partial. In addition to the normal caveats of --partial (mixing old and new history, no automatic remapping of refs/remotes/origin/* to refs/heads/*, etc.), this also may cause problems for pruning of degenerate empty merge commits when negative revisions are specified.
es: Limitar la reescritura del historial a las referencias especificadas. Implica --partial. Además de las advertencias normales de --partial (mezclar historial antiguo y nuevo, no remapear automáticamente refs/remotes/origin/* a refs/heads/*, etc.), esto también puede causar problemas al podar commits de fusión vacíos degenerados cuando se especifican revisiones negativas.

source: Do not change the repository. Run `git fast-export` and filter its output, and save both the original and the filtered version for comparison. This also disables rewriting commit messages due to not knowing new commit IDs and disables filtering of some empty commits due to inability to query the fast-import backend.
es: No cambiar el repositorio. Ejecutar `git fast-export` y filtrar su salida, y guardar tanto la versión original como la filtrada para comparación. Esto también deshabilita la reescritura de mensajes de commit debido a no conocer los nuevos IDs de commit y deshabilita el filtrado de algunos commits vacíos debido a la incapacidad de consultar el backend fast-import.

source: Print additional information about operations being performed and commands being run. When used together with --dry-run, also show extra information about what would be run.
es: Imprimir información adicional sobre las operaciones que se están realizando y los comandos que se ejecutan. Cuando se usa junto con --dry-run, también muestra información extra sobre lo que se ejecutaría.

source: Instead of running `git fast-export` and filtering its output, filter the fast-export stream from stdin. The stdin must be in the expected input format (e.g. it needs to include original-oid directives).
es: En lugar de ejecutar `git fast-export` y filtrar su salida, filtrar el flujo fast-export desde stdin. El stdin debe estar en el formato de entrada esperado (por ejemplo, debe incluir directivas original-oid).

source: Pass --quiet to other git commands called
es: Pasar --quiet a otros comandos git llamados

source: Error: --analyze is incompatible with --path* flags; it's a read-only operation.
es: Error: --analyze es incompatible con las banderas --path*; es una operación de solo lectura.

source: Error: --analyze is incompatible with --stdin.
es: Error: --analyze es incompatible con --stdin.

source: Error: --use-base-name and --path-rename are incompatible.
es: Error: --use-base-name y --path-rename son incompatibles.

source: Error: need git >= 2.24.0
es: Error: se necesita git >= 2.24.0

source: Error: need git >= 2.23.0
es: Error: se necesita git >= 2.23.0

source: Error: need git >= 2.22.0
es: Error: se necesita git >= 2.22.0

source: Error: could not parse --strip-blobs-bigger-than argument %s
es: Error: no se pudo analizar el argumento --strip-blobs-bigger-than %s

source: Error: --file-info-callback is incompatible with --stdin, --blob-callback, and --filename-callback.
es: Error: --file-info-callback es incompatible con --stdin, --blob-callback, y --filename-callback.

source: Error: In %s, 'glob:' and '==>' are incompatible (renaming globs makes no sense)
es: Error: En %s, 'glob:' y '==>' son incompatibles (renombrar globs no tiene sentido)

source: Error: When rename directories, if OLDNAME and NEW_NAME are both non-empty and either ends with a slash then both must.
es: Error: Al renombrar directorios, si OLDNAME y NEW_NAME no están vacíos y alguno termina con una barra, entonces ambos deben hacerlo.

source: No arguments specified.
es: No se especificaron argumentos.

source: Unhandled change type(s): %(change_type)s (in commit %(commit)s)
es: Tipo(s) de cambio no manejado(s): %(change_type)s (en el commit %(commit)s)

source: Processed %d commits
es: Procesados %d commits

source: Nothing to analyze; repository is empty.
es: Nada que analizar; el repositorio está vacío.

source: Error: rev-list|diff-tree pipeline failed; see above.
es: Error: la tubería rev-list|diff-tree falló; ver arriba.

source: <present>
es: <presente>

source: Overall Statistics
es: Estadísticas generales

source: Number of commits
es: Número de commits

source: Number of filenames
es: Número de nombres de archivo

source: Number of directories
es: Número de directorios

source: Number of file extensions
es: Número de extensiones de archivo

source: Total unpacked size (bytes)
es: Tamaño total desempaquetado (bytes)

source: Total packed size (bytes)
es: Tamaño total empaquetado (bytes)

source: Caveats
es: Advertencias

source: Sizes
es: Tamaños
