Repository: samuelAriza/HireLoop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: user
es: usuario

source: content type
es: tipo de contenido

source: object id
es: id de objeto

source: quantity
es: cantidad

source: added at
es: añadido el

source: Cart Item
es: Artículo del Carrito

source: Cart Items
es: Artículos del Carrito

source: items quantity
es: cantidad de artículos

source: Wishlist Item
es: Artículo de la Lista de Deseos

source: Wishlist Items
es: Artículos de la Lista de Deseos

source: Cart - HireLoop
es: Carrito - HireLoop

source: Shopping Cart
es: Carrito de Compras

source: Graduation Cap Icon
es: Ícono de Birrete

source: Briefcase Icon
es: Ícono de Maletín

source: Clock Icon
es: Ícono de Reloj

source: %(duration)s minute%(duration|pluralize)s
es: %(duration)s minuto%(duration|pluralize)s

source: %(delivery)s day{{ delivery|pluralize }}
es: %(delivery)s día{{ delivery|pluralize }}

source: Are you sure you want to remove this item from the cart?
es: ¿Está seguro de que desea eliminar este artículo del carrito?

source: Remove
es: Eliminar

source: Cart Summary
es: Resumen del Carrito

source: Items:
es: Artículos:

source: Credit Card Icon
es: Ícono de Tarjeta de Crédito

source: Proceed to Payment
es: Proceder al Pago

source: Cart pagination
es: Paginación del carrito

source: First
es: Primera

source: First Page
es: Primera Página

source: Previous
es: Anterior

source: Next
es: Siguiente

source: Last
es: Última

source: Last Page
es: Última Página

source: Page {{ current_page }} of %(total_pages)s
es: Página {{ current_page }} de %(total_pages)s

source: Your cart is empty
es: Tu carrito está vacío

source: Explore our services and add some to your cart
es: Explora nuestros servicios y añade algunos a tu carrito

source: Search Icon
es: Ícono de Búsqueda

source: Explore Services
es: Explorar Servicios

source: Wishlist
es: Lista de Deseos

source: My Wishlist
es: Mi Lista de Deseos

source: %(duration)s minute%(duration|pluralize)s
es: %(duration)s minuto%(duration|pluralize)s

source: %(delivery)s day%(delivery|pluralize)s
es: %(delivery)s día%(delivery|pluralize)s

source: View Details
es: Ver Detalles

source: Add to Cart
es: Añadir al Carrito

source: ID not available
es: ID no disponible

source: Wishlist pagination
es: Paginación de la lista de deseos

source: Page %(current_page)s of %(total_pages)s
es: Página %(current_page)s de %(total_pages)s

source: Your wishlist is empty
es: Tu lista de deseos está vacía

source: Add services to your wishlist to find them easily later!
es: ¡Añade servicios a tu lista de deseos para encontrarlos fácilmente después!

source: Username
es: Nombre de usuario

source: your@email.com
es: tu@email.com

source: Email
es: Correo electrónico

source: Password
es: Contraseña

source: Password confirmation
es: Confirmación de contraseña

source: Enter a password with at least 8 characters, including letters and numbers.
es: Ingrese una contraseña con al menos 8 caracteres, incluyendo letras y números.

source: Please enter a correct %(username)s and password. Note that both fields may be case-sensitive.
es: Por favor, ingrese un %(username)s y contraseña correctos. Tenga en cuenta que ambos campos pueden ser sensibles a mayúsculas y minúsculas.

source: This account is inactive.
es: Esta cuenta está inactiva.

source: https://example.com
es: https://ejemplo.com

source: Title
es: Título

source: Description
es: Descripción

source: Demo URL
es: URL de demostración

source: Image
es: Imagen

source: Optional: Provide a link to a live demo or example of your work.
es: Opcional: Proporciona un enlace a una demostración en vivo o ejemplo de tu trabajo.

source: Upload an image showcasing your work. Supported formats: JPEG, PNG, GIF, WebP.
es: Suba una imagen que muestre su trabajo. Formatos compatibles: JPEG, PNG, GIF, WebP.

source: Update Image
es: Actualizar Imagen

source: Choose a new image to replace the current one. Supported formats: JPEG, PNG, GIF, WebP.
es: Elija una nueva imagen para reemplazar la actual. Formatos compatibles: JPEG, PNG, GIF, WebP.

source: Company
es: Empresa

source: Billing Address
es: Dirección de facturación

source: Billing Email
es: Correo de facturación

source: Email used for invoices and payment notifications.
es: Correo utilizado para facturas y notificaciones de pago.

source: Enter skills separated by commas (e.g., Python, Django, JavaScript)
es: Ingresa habilidades separadas por comas (ej: Python, Django, JavaScript)

source: Skills
es: Habilidades

source: Enter your skills separated by commas
es: Ingresa tus habilidades separadas por comas

source: Bio
es: Biografía

source: Tell us about yourself, your experience, and what you specialize in.
es: Cuéntanos sobre ti, tu experiencia y en qué te especializas.

source: Profile Image
es: Imagen de Perfil

source: Upload a profile picture. Max size: 5MB. Supported formats: JPG, PNG, GIF, WebP.
es: Suba una foto de perfil. Tamaño máximo: 5MB. Formatos compatibles: JPG, PNG, GIF, WebP.

source: Image size must be less than 5MB
es: El tamaño de la imagen debe ser menor a 5MB

source: File must be an image
es: El archivo debe ser una imagen

source: Search
es: Buscar

source: Category
es: Categoría

source: Min Price
es: Precio Mínimo

source: Max Price
es: Precio Máximo

source: You need a %(profile)s profile to access this page.
es: Necesita un perfil %(profile)s para acceder a esta página.

source: email address
es: dirección de correo electrónico

source: Upload a profile image
es: Sube una imagen de perfil

source: Client
es: Cliente

source: Enter skills separated by commas
es: Ingrese habilidades separadas por comas

source: Link to the portfolio item
es: Enlace al elemento del portafolio

source: Upload a portfolio item image
es: Sube una imagen del elemento del portafolio

source: Portfolio Item
es: Elemento del Portafolio

source: Portfolio Items
es: Elementos del Portafolio

source: Unknown action: %(action)s
es: Acción desconocida: %(action)s

source: Profile image updated successfully!
es: ¡Imagen de perfil actualizada correctamente!

source: Failed to update profile image.
es: Error al actualizar la imagen de perfil.

source: Profile image deleted successfully!
es: ¡Imagen de perfil eliminada correctamente!

source: Failed to delete profile image.
es: Error al eliminar la imagen de perfil.

source: Invalid profile type for deletion.
es: Tipo de perfil inválido para eliminación.

source: %(profile)s profile deleted successfully!
es: ¡Perfil %(profile)s eliminado con éxito!

source: %(profile)s profile not found or could not be deleted.
es: Perfil %(profile)s no encontrado o no se pudo eliminar.

source: Invalid profile type.
es: Tipo de perfil inválido.

source: %(profile_type)s profile not found.
es: Perfil %(profile_type)s no encontrado.

source: %(profile_type)s profile updated successfully!
es: ¡Perfil %(profile_type)s actualizado con éxito!

source: Failed to update %(profile_type)s profile.
es: No se pudo actualizar el perfil %(profile_type)s.

source: Error updating profile: %(error)s
es: Error al actualizar el perfil: %(error)s

source: Please correct the errors in the form.
es: Por favor, corrija los errores en el formulario.

source: Portfolio ID not provided.
es: ID del portafolio no proporcionado.

source: Portfolio item not found.
es: Elemento del portafolio no encontrado.

source: You do not have permission to edit this portfolio item.
es: No tienes permiso para editar este elemento del portafolio.

source: Portfolio item updated successfully!
es: ¡Elemento del portafolio actualizado correctamente!

source: Failed to update portfolio item.
es: Error al actualizar el elemento del portafolio.

source: Error updating portfolio item: %(error)s
es: Error al actualizar el elemento del portafolio: %(error)s

source: You do not have permission to delete this portfolio item.
es: No tienes permiso para eliminar este elemento del portafolio.

source: Portfolio "%(title)s" deleted successfully!
es: ¡Portafolio "%(title)s" eliminado con éxito!

source: Failed to delete portfolio item.
es: Error al eliminar el elemento del portafolio.

source: Error deleting portfolio item: %(error)s
es: Error al eliminar el elemento del portafolio: %(error)s

source: Invalid image file
es: Archivo de imagen inválido

source: Subclasses must implement get_upload_directory
es: Las subclases deben implementar get_upload_directory

source: Subclasses must implement _get_default_image_url
es: Las subclases deben implementar _get_default_image_url

source: Failed to upload image: %(error)s
es: Error al subir la imagen: %(error)s

source: Error getting public portfolio items: %(error)s
es: Error al obtener elementos públicos del portafolio: %(error)s

source: Error getting portfolios: %(error)s
es: Error al obtener portafolios: %(error)s

source: Error deleting freelancer profile: %(error)s
es: Error al eliminar el perfil de freelancer: %(error)s

source: Error deleting client profile: %(error)s
es: Error al eliminar el perfil del cliente: %(error)s

source: Error updating profile image: %(error)s
es: Error al actualizar la imagen de perfil: %(error)s

source: Error deleting profile image: %(error)s
es: Error al eliminar la imagen de perfil: %(error)s

source: breadcrumb
es: miga de pan

source: Home
es: Inicio

source: My Profile
es: Mi Perfil

source: Create Portfolio Item
es: Crear Elemento del Portafolio

source: Cancel
es: Cancelar

source: Create %(profile_type)s Profile
es: Crear perfil %(profile_type)s

source: Create %(profile_type)s Profile
es: Crear perfil %(profile_type)s

source: Create Profile
es: Crear Perfil

source: Log In
es: Iniciar Sesión

source: Sign In
es: Iniciar Sesión

source: Don’t have an account?
es: ¿No tiene una cuenta?

source: Sign Up
es: Registrarse

source: User
es: Usuario

source: Profile
es: Perfil

source: No role defined
es: Sin rol definido

source: Change Photo
es: Cambiar Foto

source: Delete Photo
es: Eliminar Foto

source: Update Profile Image
es: Actualizar Imagen de Perfil

source: Choose Image
es: Elegir Imagen

source: Upload
es: Subir

source: Create Freelancer Profile
es: Crear Perfil de Freelancer

source: Create Client Profile
es: Crear Perfil de Cliente

source: Portfolio
es: Portafolio

source: Applications
es: Aplicaciones

source: Edit
es: Editar

source: Delete
es: Eliminar

source: Save
es: Guardar

source: No skills registered
es: Sin habilidades registradas

source: No bio available
es: Sin biografía disponible

source: My Portfolio Items
es: Mis Elementos del Portafolio

source: Add Portfolio Item
es: Añadir Elemento del Portafolio

source: https://your-demo-site.com
es: https://tu-sitio-demo.com

source: Current: {{ image_name }}
es: Actual: {{ image_name }}

source: Created
es: Creado

source: Edit Portfolio
es: Editar Portafolio

source: Delete Portfolio
es: Eliminar Portafolio

source: Are you sure you want to delete this portfolio item: %(title)s?
es: ¿Está seguro de que desea eliminar este elemento del portafolio: %(title)s?

source: No Portfolio Items Yet
es: Aún No Hay Elementos en el Portafolio

source: Showcase your work by creating your first portfolio item.
es: Muestra tu trabajo creando tu primer elemento del portafolio.

source: Create Your First Portfolio Item
es: Crea Tu Primer Elemento del Portafolio

source: This user hasn't added any portfolio items yet.
es: Este usuario aún no ha añadido elementos al portafolio.

source: My Applications
es: Mis Aplicaciones

source: Add Application
es: Añadir Aplicación

source: Proposed Payment
es: Pago Propuesto

source: No Applications Yet
es: Aún No Hay Aplicaciones

source: Showcase your applications by creating your first application.
es: Muestra tus aplicaciones creando tu primera aplicación.

source: Create Your First Application
es: Crea Tu Primera Aplicación

source: This user hasn't added any applications yet.
es: Este usuario aún no ha añadido aplicaciones.

source: No company registered
es: Sin empresa registrada

source: No billing email
es: Sin correo de facturación

source: No Profiles Available
es: No Hay Perfiles Disponibles

source: You need at least one profile to start using the platform.
es: Necesitas al menos un perfil para comenzar a usar la plataforma.

source: Be a Freelancer
es: Ser Freelancer

source: Be a Client
es: Ser Cliente

source: This user has not created any profiles yet.
es: Este usuario aún no ha creado perfiles.

source: Recent Activity
es: Actividad Reciente

source: Active Profiles
es: Perfiles Activos

source: E.g., mentorship, design, project...
es: Ej: mentoría, diseño, proyecto...

source: All categories
es: Todas las categorías

source: Min. price
es: Precio mín.

source: Max. price
es: Precio máx.

source: Showing %(count)s result
es: Mostrando %(count)s resultado

source: containing
es: que contenga

source: in category
es: en categoría

source: price from
es: precio desde

source: up to
es: hasta

source: Clear filters
es: Limpiar filtros

source: Quick filters:
es: Filtros rápidos:

source: Up to $50
es: Hasta $50

source: Up to $100
es: Hasta $100

source: Your career journey
es: Tu trayectoria profesional

source: starts here
es: comienza aquí

source: Join thousands of freelancers and clients who trust HireLoop to connect, collaborate, and grow their businesses. Whether you're offering services, seeking projects, or looking for mentorship, we provide the complete ecosystem to accelerate your professional success.
es: Únase a miles de freelancers y clientes que confían en HireLoop para conectar, colaborar y hacer crecer sus negocios. Ya sea que ofrezca servicios, busque proyectos o mentoría, proporcionamos el ecosistema completo para acelerar su éxito profesional.

source: Premium Services
es: Servicios Premium

source: Expert Mentorship
es: Mentoría Experta

source: Quality Projects
es: Proyectos de Calidad

source: Secure Payments
es: Pagos Seguros

source: Already have an account?
es: ¿Ya tienes una cuenta?

source: You cannot have more than 20 skills
es: No puedes tener más de 20 habilidades

source: English
es: Inglés

source: Topic
es: Tema

source: Start Time
es: Hora de Inicio

source: Duration (minutes)
es: Duración (minutos)

source: Status
es: Estado

source: Brief description of the mentorship session topic.
es: Breve descripción del tema de la sesión de mentoría.

source: Select the date and time when the session will start.
es: Selecciona la fecha y hora en que comenzará la sesión.

source: Duration of the session in minutes (e.g., 30, 60).
es: Duración de la sesión en minutos (ej: 30, 60).

source: Scheduled
es: Programado

source: Completed
es: Completado

source: Canceled
es: Cancelado

source: No Show
es: No se presentó

source: The main topic of the mentorship session
es: El tema principal de la sesión de mentoría

source: When the session will begin
es: Cuándo comenzará la sesión

source: How long the session will last in minutes
es: Cuánto durará la sesión en minutos

source: Mentee
es: Aprendiz

source: Image Path
es: Ruta de la Imagen

source: Created At
es: Creado El

source: Updated At
es: Actualizado El

source: Mentorship Session
es: Sesión de Mentoría

source: Mentorship Sessions
es: Sesiones de Mentoría

source: Mentorship: {topic}
es: Mentoría: {topic}

source: Mentorship session about '{topic}', duration {duration} minutes.
es: Sesión de mentoría sobre '{topic}', duración {duration} minutos.

source: Mentorship
es: Mentoría

source: Mentorship session not found
es: Sesión de mentoría no encontrada

source: My Mentorship
es: Mi Mentoría

source: Update Session
es: Actualizar Sesión

source: Create Session
es: Crear Sesión

source: Update Mentorship Session
es: Actualizar Sesión de Mentoría

source: Create New Mentorship Session
es: Crear Nueva Sesión de Mentoría

source: Duration
es: Duración

source: Mentorship Image
es: Imagen de Mentoría

source: Optional. Supported formats: JPEG, PNG, GIF. Max size: 5MB.
es: Opcional. Formatos soportados: JPEG, PNG, GIF. Tamaño máximo: 5MB.

source: Tips for a Successful Mentorship
es: Consejos para una Mentoría Exitosa

source: Clear Topic
es: Tema Claro

source: Be specific about what the session covers
es: Sé específico sobre lo que cubre la sesión

source: Mention the key skills or knowledge areas
es: Menciona las habilidades clave o áreas de conocimiento

source: Scheduling
es: Programación

source: Set a clear start time and duration
es: Establece una hora de inicio y duración clara

source: Make sure both mentor and mentee are available
es: Asegúrate de que tanto el mentor como el aprendiz estén disponibles

source: My Mentorship Sessions
es: Mis Sesiones de Mentoría

source: Cancelled
es: Cancelado

source: Start
es: Inicio

source: Updated
es: Actualizado

source: Page navigation
es: Navegación de páginas

source: Page %(current)s of %(total)s
es: Página %(current)s de %(total)s

source: You haven't created any mentorship sessions
es: No has creado ninguna sesión de mentoría

source: Create your first session to start mentoring!
es: ¡Crea tu primera sesión para comenzar a dar mentoría!

source: Create My First Session
es: Crear Mi Primera Sesión

source: You need a freelancer profile to create sessions.
es: Necesitas un perfil de freelancer para crear sesiones.

source: Are you sure you want to delete "%(topic)s"?
es: ¿Está seguro de que desea eliminar "%(topic)s"?

source: Yes, delete
es: Sí, eliminar

source: By
es: Por

source: Duration: %(duration)s minute%(duration|pluralize)s
es: Duración: %(duration)s minuto%(duration|pluralize)s

source: Actions
es: Acciones

source: This is your own mentorship session
es: Esta es tu propia sesión de mentoría

source: Book Session
es: Reservar Sesión

source: Remove from Cart
es: Quitar del Carrito

source: Add to Wishlist
es: Añadir a Lista de Deseos

source: Remove from Wishlist
es: Quitar de Lista de Deseos

source: Log In to Purchase
es: Inicia Sesión para Comprar

source: Available Mentorship Sessions
es: Sesiones de Mentoría Disponibles

source: No mentorship sessions found
es: No se encontraron sesiones de mentoría

source: Currently, no mentorship sessions are available.
es: Actualmente, no hay sesiones de mentoría disponibles.

source: Sessions pagination
es: Paginación de sesiones

source: Service Image
es: Imagen del Servicio

source: Optional. Upload an image for your microservice (JPEG, PNG, GIF). Max 5MB.
es: Opcional. Suba una imagen para su microservicio (JPEG, PNG, GIF). Máx. 5MB.

source: Price
es: Precio

source: Delivery Time
es: Tiempo de Entrega

source: Active
es: Activo

source: A clear and attractive title for your service.
es: Un título claro y atractivo para tu servicio.

source: Describe what you offer in detail. Include what’s included and any requirements.
es: Describa lo que ofrece en detalle. Incluya lo que está incluido y cualquier requisito.

source: Fixed price for this service (in USD).
es: Precio fijo para este servicio (en USD).

source: Example: 3 days, 1 week, etc.
es: Ejemplo: 3 días, 1 semana, etc.

source: Uncheck to hide this service from the marketplace.
es: Desmarca para ocultar este servicio del mercado.

source: e.g., I will design a professional logo
es: ej: Diseñaré un logo profesional

source: Detailed description...
es: Descripción detallada...

source: e.g., 3 days
es: ej: 3 días

source: Name
es: Nombre

source: Enter a unique category name.
es: Ingresa un nombre de categoría único.

source: URL-friendly version of the name.
es: Versión amigable para URL del nombre.

source: Categories
es: Categorías

source: The freelancer offering this microservice.
es: El freelancer que ofrece este microservicio.

source: Select the category that best fits this service.
es: Selecciona la categoría que mejor se ajuste a este servicio.

source: A clear, compelling title for your service.
es: Un título claro y convincente para tu servicio.

source: Describe what you offer, what’s included, and any requirements.
es: Describa lo que ofrece, lo que está incluido y cualquier requisito.

source: Price (USD)
es: Precio (USD)

source: Fixed price for this service in USD.
es: Precio fijo para este servicio en USD.

source: Delivery Time (days)
es: Tiempo de Entrega (días)

source: How many days it takes to deliver the final work.
es: Cuántos días toma entregar el trabajo final.

source: Path to the uploaded service image.
es: Ruta a la imagen del servicio subida.

source: MicroService
es: Microservicio

source: MicroServices
es: Microservicios

source: Invalid image file. Must be JPEG, PNG, or GIF and under 5MB.
es: Archivo de imagen inválido. Debe ser JPEG, PNG o GIF y menor a 5MB.

source: Freelancer profile is required.
es: Se requiere perfil de freelancer.

source: Microservice does not exist.
es: El microservicio no existe.

source: Microservice is already inactive.
es: El microservicio ya está inactivo.

source: My Services
es: Mis Servicios

source: Update MicroService
es: Actualizar Microservicio

source: Create MicroService
es: Crear Microservicio

source: Create New MicroService
es: Crear Nuevo Microservicio

source: Service Title
es: Título del Servicio

source: Publish service (visible to the public)
es: Publicar servicio (visible al público)

source: MicroService Image
es: Imagen del Microservicio

source: Update Service
es: Actualizar Servicio

source: Tips for a Great Service
es: Consejos para un Gran Servicio

source: Effective Title
es: Título Efectivo

source: Be specific and clear
es: Sé específico y claro

source: Include relevant keywords
es: Incluye palabras clave relevantes

source: Avoid excessive technical jargon
es: Evita jerga técnica excesiva

source: Detailed Description
es: Descripción Detallada

source: Explain what is included
es: Explica qué está incluido

source: Mention your methodology
es: Menciona tu metodología

source: Specify deliverables
es: Especifica los entregables

source: My MicroServices
es: Mis Microservicios

source: Inactive
es: Inactivo

source: days
es: días

source: You haven't created any microservices
es: No has creado ningún microservicio

source: Create your first service to start offering your skills!
es: ¡Crea tu primer servicio para comenzar a ofrecer tus habilidades!

source: Create My First Service
es: Crear Mi Primer Servicio

source: You need a freelancer profile to create microservices.
es: Necesitas un perfil de freelancer para crear microservicios.

source: Are you sure you want to delete "%(title)s"?
es: ¿Está seguro de que desea eliminar "%(title)s"?

source: Delivery time
es: Tiempo de entrega

source: %(days)s day%(days|pluralize)s
es: %(days)s día%(days|pluralize)s

source: This is your own microservice
es: Este es tu propio microservicio

source: Available Microservices
es: Microservicios Disponibles

source: %(days)s day%(days|pluralize)s
es: %(days)s día%(days|pluralize)s

source: No microservices found
es: No se encontraron microservicios

source: Currently, no microservices are available.
es: Actualmente, no hay microservicios disponibles.

source: Microservices pagination
es: Paginación de microservicios

source: Pending
es: Pendiente

source: Succeeded
es: Exitoso

source: Failed
es: Fallido

source: Requires Payment Method
es: Requiere Método de Pago

source: Requires Confirmation
es: Requiere Confirmación

source: Requires Action
es: Requiere Acción

source: The user who initiated this payment.
es: El usuario que inició este pago.

source: Stripe Checkout Session ID
es: ID de Sesión de Pago Stripe

source: Unique identifier for the Stripe Checkout Session.
es: Identificador único para la Sesión de Pago Stripe.

source: Stripe Payment Intent ID
es: ID de Intención de Pago Stripe

source: Payment Intent ID if using Payment Intents API.
es: ID de Intención de Pago si se usa la API de Payment Intents.

source: Amount
es: Monto

source: Total amount in the currency's smallest unit (e.g., cents for USD).
es: Monto total en la unidad más pequeña de la moneda (ej: centavos para USD).
