Repository: samuelAriza/HireLoop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Packed size represents what size your repository would be if no trees, commits, tags, or other metadata were included (though it may fail to represent de-duplication; see below). It also represents the current packing, which may be suboptimal if you haven't gc'ed for a while. Unpacked size represents what size your repository would be if no trees, commits, tags, or other metadata were included AND if no files were packed; i.e., without delta-ing or compression. Both unpacked and packed sizes can be slightly misleading. Deleting a blob from history not save as much space as the unpacked size, because it is obviously normally stored in packed form. Also, deleting a blob from history may not save as much space as its packed size either, because another blob could be stored as a delta against that blob, so when you remove one blob another blob's packed size may grow. Also, the sum of the packed sizes can add up to more than the repository size; if the same contents appeared in the repository in multiple places, git will automatically de-dupe and store only one copy, while the way sizes are added in this analysis adds the size for each file path that has those contents. Further, if a file is ever reverted to a previous version's contents, the previous version's size will be counted multiple times in this analysis, even though git will only store it once.
es: El tamaño empaquetado representa el tamaño que tendría tu repositorio si no se incluyeran árboles, commits, etiquetas u otros metadatos (aunque puede no representar la desduplicación; véase más abajo). También representa el empaquetado actual, que puede ser subóptimo si no has ejecutado gc en un tiempo. El tamaño desempaquetado representa el tamaño que tendría tu repositorio si no se incluyeran árboles, commits, etiquetas u otros metadatos Y si ningún archivo estuviera empaquetado; es decir, sin delta ni compresión. Tanto los tamaños desempaquetados como los empaquetados pueden ser un poco engañosos. Eliminar un blob del historial no ahorra tanto espacio como el tamaño desempaquetado, porque obviamente normalmente se almacena en forma empaquetada. Además, eliminar un blob del historial puede no ahorrar tanto espacio como su tamaño empaquetado, porque otro blob podría almacenarse como un delta contra ese blob, por lo que al eliminar un blob, el tamaño empaquetado de otro blob puede crecer. Además, la suma de los tamaños empaquetados puede ser mayor que el tamaño del repositorio; si el mismo contenido aparece en el repositorio en múltiples lugares, git automáticamente desduplica y almacena solo una copia, mientras que la forma en que se suman los tamaños en este análisis añade el tamaño para cada ruta de archivo que tiene ese contenido. Además, si un archivo alguna vez se revierte al contenido de una versión anterior, el tamaño de la versión anterior se contará varias veces en este análisis, aunque git solo lo almacene una vez.

source: Deletions
es: Eliminaciones

source: Whether a file is deleted is not a binary quality, since it can be deleted on some branches but still exist in others. Also, it might exist in an old tag, but have been deleted in versions newer than that. More thorough tracking could be done, including looking at merge commits where one side of history deleted and the other modified, in order to give a more holistic picture of deletions. However, that algorithm would not only be more complex to implement, it'd also be quite difficult to present and interpret by users. Since --analyze is just about getting a high-level rough picture of history, it instead implements the simplistic rule that is good enough for 98% of cases: A file is marked as deleted if the last commit in the fast-export stream that mentions the file lists it as deleted. This makes it dependent on topological ordering, but generally gives the "right" answer.
es: Si un archivo está eliminado no es una cualidad binaria, ya que puede estar eliminado en algunas ramas pero aún existir en otras. Además, podría existir en una etiqueta antigua, pero haber sido eliminado en versiones más recientes que esa. Se podría hacer un seguimiento más exhaustivo, incluyendo la revisión de commits de fusión donde un lado de la historia eliminó y el otro modificó, para dar una imagen más holística de las eliminaciones. Sin embargo, ese algoritmo no solo sería más complejo de implementar, sino que también sería bastante difícil de presentar e interpretar para los usuarios. Dado que --analyze se trata solo de obtener una imagen general y aproximada de la historia, en su lugar implementa la regla simplista que es suficiente para el 98% de los casos: Un archivo se marca como eliminado si el último commit en el flujo fast-export que menciona el archivo lo lista como eliminado. Esto lo hace dependiente del orden topológico, pero generalmente da la respuesta "correcta".

source: Renames
es: Cambios de nombre

source: Renames share the same non-binary nature that deletions do, plus additional challenges: * If the renamed file is renamed again, instead of just two names for a path you can have three or more. * Rename pairs of the form (oldname, newname) that we consider to be different names of the "same file" might only be valid over certain commit ranges. For example, if a new commit reintroduces a file named oldname, then new versions of oldname aren't the "same file" anymore. We could try to portray this to the user, but it's easier for the user to just break the pairing and only report unbroken rename pairings to the user. * The ability for users to rename files differently in different branches means that our chains of renames will not necessarily be linear but may branch out.
es: Los renombramientos comparten la misma naturaleza no binaria que las eliminaciones, además de desafíos adicionales: * Si el archivo renombrado se renombra de nuevo, en lugar de solo dos nombres para una ruta, puedes tener tres o más. * Los pares de renombramientos de la forma (nombreantiguo, nombrenuevo) que consideramos diferentes nombres del "mismo archivo" podrían ser válidos solo en ciertos rangos de commits. Por ejemplo, si un nuevo commit reintroduce un archivo llamado nombreantiguo, entonces las nuevas versiones de nombreantiguo ya no son el "mismo archivo". Podríamos intentar mostrar esto al usuario, pero es más fácil para el usuario simplemente romper el emparejamiento y solo reportar los emparejamientos de renombramientos no rotos al usuario. * La capacidad de los usuarios para renombrar archivos de manera diferente en distintas ramas significa que nuestras cadenas de renombramientos no serán necesariamente lineales sino que pueden ramificarse.

source: Deleted directories by reverse size
es: Directorios eliminados por tamaño inverso

source: Format: unpacked size, packed size, date deleted, directory name
es: Formato: tamaño desempaquetado, tamaño empaquetado, fecha de eliminación, nombre del directorio

source: All directories by reverse size
es: Todos los directorios por tamaño inverso

source: Deleted extensions by reverse size
es: Extensiones eliminadas por tamaño inverso

source: Format: unpacked size, packed size, date deleted, extension name
es: Formato: tamaño desempaquetado, tamaño empaquetado, fecha de eliminación, nombre de la extensión

source: <no extension>
es: <sin extensión>

source: All extensions by reverse size
es: Todas las extensiones por tamaño inverso

source: Deleted paths by reverse accumulated size
es: Rutas eliminadas por tamaño acumulado inverso

source: Format: unpacked size, packed size, date deleted, path name(s)
es: Formato: tamaño desempaquetado, tamaño empaquetado, fecha de eliminación, nombre(s) de ruta

source: All paths by reverse accumulated size
es: Todas las rutas por tamaño acumulado inverso

source: Format: unpacked size, packed size, date deleted, path name
es: Formato: tamaño desempaquetado, tamaño empaquetado, fecha de eliminación, nombre de ruta

source: Files by sha and associated pathnames in reverse size
es: Archivos por sha y nombres de ruta asociados en tamaño inverso

source: Format: sha, unpacked size, packed size, filename(s) object stored as
es: Formato: sha, tamaño desempaquetado, tamaño empaquetado, nombre(s) de archivo objeto almacenado como

source: Warning: Removing recursively: "%s"
es: Advertencia: Eliminando recursivamente: "%s"

source: Error: dir already exists (use --force to delete): "%s"
es: Error: el directorio ya existe (use --force para eliminar): "%s"

source: Writing reports to %s...
es: Escribiendo informes en %s...

source: done.
es: listo.

source: Parsed %d commits
es: Analizados %d commits

source: Error: Cannot pass a %s_callback to RepoFilter AND pass --%s-callback
es: Error: No se puede pasar un %s_callback a RepoFilter Y pasar --%s-callback

source: Error: --%s-callback should have a return statement
es: Error: --%s-callback debería tener una instrucción return

source: Error: Cannot specify --sensitive-data-removal on a follow-up invocation of git-filter-repo unless it was specified in previously runs.
es: Error: No se puede especificar --sensitive-data-removal en una invocación posterior de git-filter-repo a menos que se haya especificado en ejecuciones anteriores.

source: Error: sensitive data removal is incompatible with --stdin
es: Error: la eliminación de datos sensibles es incompatible con --stdin

source: Error: sensitive data removal is incompatible with --source and --target
es: Error: la eliminación de datos sensibles es incompatible con --source y --target

source: Note: when cloning local repositories, you need to pass --no-local to git clone to avoid this issue.
es: Nota: al clonar repositorios locales, debe pasar --no-local a git clone para evitar este problema.

source: Aborting: Refusing to destructively overwrite repo history since this does not look like a fresh clone. (%s) %sPlease operate on a fresh clone instead. If you want to proceed anyway, use --force.
es: Abortando: Se rechaza sobrescribir destructivamente el historial del repositorio ya que esto no parece un clon nuevo. (%s) %sPor favor, opere sobre un clon nuevo. Si desea continuar de todos modos, use --force.

source: GIT_DIR must be .
es: GIT_DIR debe ser .

source: GIT_DIR must be .git
es: GIT_DIR debe ser .git

source: Aborting: Cannot rewrite history on a case insensitive filesystem since you have refs that differ in case only: %s
es: Abortando: No se puede reescribir el historial en un sistema de archivos insensible a mayúsculas y minúsculas ya que tiene referencias que difieren solo en mayúsculas: %s

source: Aborting: Cannot rewrite history on a character normalizing filesystem since you have refs that differ in normalization: %s
es: Abortando: No se puede reescribir el historial en un sistema de archivos que normaliza caracteres ya que tiene referencias que difieren en la normalización: %s

source: expected freshly packed repo
es: se esperaba un repositorio recién empaquetado

source: expected one remote, origin
es: se esperaba un remoto, origin

source: expected at most one entry in the reflog for %s
es: se esperaba como máximo una entrada en el reflog para %s

source: has stashed changes
es: tiene cambios guardados

source: you have uncommitted changes
es: tiene cambios sin confirmar

source: you have unstaged changes
es: tiene cambios no preparados

source: you have untracked changes
es: tiene cambios no rastreados

source: %s exists, but %s not found
es: %s existe, pero %s no se encontró

source: %s does not match %s
es: %s no coincide con %s

source: you have multiple worktrees
es: tiene múltiples worktrees

source: Repacking your repo and cleaning out old unneeded objects
es: Reempaquetando su repositorio y limpiando objetos antiguos no necesarios

source: File renaming caused colliding pathnames!
es: ¡El cambio de nombre de archivo causó rutas de acceso en conflicto!

source: Filename: {}
es: Nombre de archivo: {}

source: Failed loading %s from %s
es: Error al cargar %s desde %s

source: Failed to find %s to save to %s
es: No se pudo encontrar %s para guardar en %s

source: Rewrote the stash.
es: Se reescribió el stash.

source: git update-ref failed; see above
es: git update-ref falló; vea arriba

source: NOTICE: Fetching all refs from origin to make sure we rewrite all history that may reference the sensitive data, via
es: AVISO: Obteniendo todas las referencias de origin para asegurarnos de reescribir todo el historial que pueda hacer referencia a los datos sensibles, a través de

source: WARNING: Fetching all refs from origin failed
es: ADVERTENCIA: Falló la obtención de todas las referencias de origin

source: NOTICE: Removing 'origin' remote; see 'Why is my origin removed?' in the manual if you want to push back there. (was %s)
es: AVISO: Eliminando el remoto 'origin'; consulte '¿Por qué se eliminó mi origin?' en el manual si desea volver a hacer push allí. (era %s)

source: old
es: antiguo

source: new
es: nuevo

source: The following commits used to be merge commits but due to filtering are now regular commits; they likely have suboptimal commit messages (e.g. "Merge branch next into master"). Original commit hash on the left, commit hash after filtering/rewriting on the right:
es: Los siguientes commits solían ser commits de fusión pero debido al filtrado ahora son commits regulares; probablemente tienen mensajes de commit subóptimos (por ejemplo, "Merge branch next into master"). Hash del commit original a la izquierda, hash del commit después del filtrado/re-escritura a la derecha:

source: The following commits were filtered out, but referenced in another commit message. The reference to the now-nonexistent commit hash (or a substring thereof) was left as-is in any commit messages:
es: Los siguientes commits fueron filtrados, pero referenciados en otro mensaje de commit. La referencia al hash de commit ahora inexistente (o una subcadena del mismo) se dejó tal cual en cualquier mensaje de commit:

source: No filtering problems encountered.
es: No se encontraron problemas de filtrado.

source: This file exists to allow you to filter again without --force, and to specify that metadata files should be updated instead of rewritten
es: Este archivo existe para permitirte filtrar de nuevo sin --force, y para especificar que los archivos de metadatos deben ser actualizados en lugar de reescritos

source: Error: fast-export failed; see above.
es: Error: fast-export falló; ver arriba.

source: Error: fast-import failed; see above.
es: Error: fast-import falló; ver arriba.

source: NOTE: Not running fast-import or cleaning up; --dry-run passed.
es: NOTA: No se ejecuta fast-import ni se limpia; se pasó --dry-run.

source: Requested filtering can be seen by comparing:
es: El filtrado solicitado puede verse comparando:

source: Requested filtering can be seen at:
es: El filtrado solicitado puede verse en:

source: Completely finished after {:.2f} seconds.
es: Completamente terminado después de {:.2f} segundos.

source: and LFS Objects Orphaned
es: y Objetos LFS Huérfanos
