Repository: samuelAriza/HireLoop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Ensure this filename has at most %(max)d character (it has %(length)d).
es: Asegúrese de que este nombre de archivo tenga como máximo %(max)d carácter (tiene %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
es: Por favor, envíe un archivo o marque la casilla de borrar, no ambos.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
es: Suba una imagen válida. El archivo que subió no era una imagen o estaba corrupto.

source: Select a valid choice. %(value)s is not one of the available choices.
es: Seleccione una opción válida. %(value)s no es una de las opciones disponibles.

source: Enter a list of values.
es: Introduzca una lista de valores.

source: Enter a complete value.
es: Introduzca un valor completo.

source: Enter a valid UUID.
es: Introduzca un UUID válido.

source: Enter a valid JSON.
es: Introduzca un JSON válido.

source: (Hidden field %(name)s) %(error)s
es: (Campo oculto %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
es: Faltan datos del ManagementForm o han sido manipulados. Campos faltantes: %(field_names)s. Puede que necesite reportar un error si el problema persiste.

source: Please submit at most %(num)d form.
es: Por favor, envíe como máximo %(num)d formulario.

source: Please submit at least %(num)d form.
es: Por favor, envíe al menos %(num)d formulario.

source: Order
es: Orden

source: Please correct the duplicate data for %(field)s.
es: Por favor, corrija los datos duplicados para %(field)s.

source: Please correct the duplicate data for %(field)s, which must be unique.
es: Por favor, corrija los datos duplicados para %(field)s, que deben ser únicos.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
es: Por favor, corrija los datos duplicados para %(field_name)s que deben ser únicos para el %(lookup)s en %(date_field)s.

source: Please correct the duplicate values below.
es: Por favor, corrija los valores duplicados a continuación.

source: The inline value did not match the parent instance.
es: El valor en línea no coincidió con la instancia principal.

source: Select a valid choice. That choice is not one of the available choices.
es: Seleccione una opción válida. Esa opción no es una de las disponibles.

source: “%(pk)s” is not a valid value.
es: “%(pk)s” no es un valor válido.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
es: %(datetime)s no pudo ser interpretado en la zona horaria %(current_timezone)s; puede ser ambiguo o puede que no exista.

source: Clear
es: Borrar

source: Currently
es: Actualmente

source: Change
es: Cambiar

source: Unknown
es: Desconocido

source: Yes
es: Sí

source: yes,no,maybe
es: sí,no,quizás

source: midnight
es: medianoche

source: noon
es: mediodía

source: Monday
es: Lunes

source: Tuesday
es: Martes

source: Wednesday
es: Miércoles

source: Thursday
es: Jueves

source: Friday
es: Viernes

source: Saturday
es: Sábado

source: Sunday
es: Domingo

source: Mon
es: Lun

source: Tue
es: Mar

source: Wed
es: Mié

source: Thu
es: Jue

source: Fri
es: Vie

source: Sat
es: Sáb

source: Sun
es: Dom

source: January
es: Enero

source: February
es: Febrero

source: March
es: Marzo

source: April
es: Abril

source: May
es: Mayo

source: June
es: Junio

source: July
es: Julio

source: August
es: Agosto

source: September
es: Septiembre

source: October
es: Octubre

source: November
es: Noviembre

source: December
es: Diciembre

source: jan
es: ene

source: apr
es: abr

source: aug
es: ago

source: dec
es: dic

# abbrev. month
source: Jan.
es: Ene.

# abbrev. month
source: March
es: Marzo

# abbrev. month
source: April
es: Abril

# abbrev. month
source: May
es: Mayo

# abbrev. month
source: June
es: Junio

# abbrev. month
source: July
es: Julio

# abbrev. month
source: Aug.
es: Ago.

# abbrev. month
source: Dec.
es: Dic.

# alt. month
source: January
es: Enero

# alt. month
source: February
es: Febrero

# alt. month
source: March
es: Marzo

# alt. month
source: April
es: Abril

# alt. month
source: May
es: Mayo

# alt. month
source: June
es: Junio

# alt. month
source: July
es: Julio

# alt. month
source: August
es: Agosto

# alt. month
source: September
es: Septiembre

# alt. month
source: October
es: Octubre

# alt. month
source: November
es: Noviembre

# alt. month
source: December
es: Diciembre

source: This is not a valid IPv6 address.
es: Esta no es una dirección IPv6 válida.

source: or
es: o

source: %(num)d year
es: %(num)d año

source: %(num)d month
es: %(num)d mes

source: %(num)d week
es: %(num)d semana

source: %(num)d day
es: %(num)d día

source: %(num)d hour
es: %(num)d hora

source: %(num)d minute
es: %(num)d minuto

source: Forbidden
es: Prohibido

source: CSRF verification failed. Request aborted.
es: La verificación CSRF falló. Solicitud abortada.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
es: Está viendo este mensaje porque este sitio HTTPS requiere que su navegador web envíe un “encabezado Referer”, pero no se envió ninguno. Este encabezado es necesario por razones de seguridad, para asegurar que su navegador no esté siendo secuestrado por terceros.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
es: Si ha configurado su navegador para deshabilitar los encabezados “Referer”, por favor vuelva a habilitarlos, al menos para este sitio, o para conexiones HTTPS, o para solicitudes de “mismo origen”.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
es: Si está usando la etiqueta <meta name="referrer" content="no-referrer"> o incluyendo el encabezado “Referrer-Policy: no-referrer”, por favor elimínelos. La protección CSRF requiere el encabezado “Referer” para realizar una verificación estricta del referer. Si le preocupa la privacidad, use alternativas como <a rel="noreferrer" …> para enlaces a sitios de terceros.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
es: Está viendo este mensaje porque este sitio requiere una cookie CSRF al enviar formularios. Esta cookie es necesaria por razones de seguridad, para asegurar que su navegador no esté siendo secuestrado por terceros.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
es: Si ha configurado su navegador para deshabilitar las cookies, por favor vuelva a habilitarlas, al menos para este sitio, o para solicitudes de “mismo origen”.

source: More information is available with DEBUG=True.
es: Más información está disponible con DEBUG=True.

source: No year specified
es: No se especificó año

source: Date out of range
es: Fecha fuera de rango

source: No month specified
es: No se especificó mes

source: No day specified
es: No se especificó día

source: No week specified
es: No se especificó semana

source: No %(verbose_name_plural)s available
es: No hay %(verbose_name_plural)s disponibles

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
es: No hay %(verbose_name_plural)s futuros disponibles porque %(class_name)s.allow_future es False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
es: Cadena de fecha inválida “%(datestr)s” con formato “%(format)s”

source: No %(verbose_name)s found matching the query
es: No se encontró %(verbose_name)s que coincida con la consulta

source: Page is not “last”, nor can it be converted to an int.
es: La página no es “última”, ni puede convertirse a un entero.

source: Invalid page (%(page_number)s): %(message)s
es: Página inválida (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
es: Lista vacía y “%(class_name)s.allow_empty” es False.

source: Directory indexes are not allowed here.
es: Los índices de directorio no están permitidos aquí.

source: “%(path)s” does not exist
es: “%(path)s” no existe

source: Index of %(directory)s
es: Índice de %(directory)s

source: The install worked successfully! Congratulations!
es: ¡La instalación funcionó correctamente! ¡Felicidades!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
es: Ver <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">notas de la versión</a> para Django %(version)s

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
es: Está viendo esta página porque <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> está en su archivo de configuración y no ha configurado ninguna URL.

source: Django Documentation
es: Documentación de Django

source: Topics, references, &amp; how-to’s
es: Temas, referencias y tutoriales

source: Tutorial: A Polling App
es: Tutorial: Una aplicación de encuestas

source: Get started with Django
es: Comience con Django

source: Django Community
es: Comunidad Django

source: Connect, get help, or contribute
es: Conéctese, obtenga ayuda o contribuya

source: Find Apps
es: Buscar aplicaciones

source: Add %(name)s
es: Agregar %(name)s

source: Error: Cannot handle glob %s
es: Error: No se puede manejar el glob %s

source: Cannot read %s
es: No se puede leer %s

source: Unimplemented function: %s
es: Función no implementada: %s

source: new name needed for rename of %s
es: se necesita un nuevo nombre para renombrar %s

source: Unhandled filechange type: %s
es: Tipo de cambio de archivo no manejado: %s

source: Couldn't parse rename source
es: No se pudo analizar la fuente del cambio de nombre

source: Malformed %(refname)s line: '%(line)s'
es: Línea %(refname)s malformada: '%(line)s'

source: Unsupported command: '%s'
es: Comando no soportado: '%s'

source: Could not parse line: '%s'
es: No se pudo analizar la línea: '%s'

source: NEXT STEPS FOR YOUR SENSITIVE DATA REMOVAL: * If you are doing your rewrite in multiple steps, ignore these next steps until you have completed all your invocations of git-filter-repo. * See the "Sensitive Data Removal" subsection of the "DISCUSSION" section of the manual for more details about any of the steps below. * Inspect this repository and verify that the sensitive data is indeed completely removed from all commits. * Force push the rewritten history to the server: %s * Contact the server admins for additional steps they need to take; the First Changed Commit(s)%s may come in handy here. * Have other colleagues with a clone either discard their clone and reclone OR follow the detailed steps in the manual to repeatedly rebase and purge the sensitive data from their copy. Again, the First Changed Commit(s)%s may come in handy. * See the "Prevent repeats and avoid future sensitive data spills" section of the manual.
es: PRÓXIMOS PASOS PARA LA ELIMINACIÓN DE DATOS SENSIBLES: * Si está realizando su reescritura en varios pasos, ignore estos próximos pasos hasta que haya completado todas sus invocaciones de git-filter-repo. * Consulte la subsección "Eliminación de datos sensibles" de la sección "DISCUSIÓN" del manual para más detalles sobre cualquiera de los pasos a continuación. * Inspeccione este repositorio y verifique que los datos sensibles estén completamente eliminados de todos los commits. * Forzar el envío de la historia reescrita al servidor: %s * Contacte a los administradores del servidor para pasos adicionales que necesiten tomar; el Primer(s) Commit(s) Cambiado(s)%s puede ser útil aquí. * Haga que otros colegas con un clon descarten su clon y vuelvan a clonarlo O sigan los pasos detallados en el manual para rebasear repetidamente y purgar los datos sensibles de su copia. Nuevamente, el Primer(s) Commit(s) Cambiado(s)%s puede ser útil. * Consulte la sección "Prevenir repeticiones y evitar futuros derrames de datos sensibles" del manual.

source: %s does not appear to be a valid git repository
es: %s no parece ser un repositorio git válido

source: Processed %d blob sizes
es: Procesados %d tamaños de blob

source: Error: unexpected `git cat-file` output: "%s"
es: Error: salida inesperada de `git cat-file`: "%s"

source: Error: --path-rename expects one colon in its argument: <old_name:new_name>.
es: Error: --path-rename espera un colon en su argumento: <old_name:new_name>.

source: Error: With --path-rename, if OLD_NAME and NEW_NAME are both non-empty and either ends with a slash then both must.
es: Error: Con --path-rename, si OLD_NAME y NEW_NAME no están vacíos y alguno termina con una barra, ambos deben hacerlo.

source: Error: Pathnames cannot begin with a '/'
es: Error: Los nombres de ruta no pueden comenzar con '/'.

source: Error: Invalid path component '%s' found in '%s'
es: Error: Componente de ruta inválido '%s' encontrado en '%s'

source: Error: HelperFilter given invalid option_string: %s
es: Error: HelperFilter recibió option_string inválido: %s

source: Rewrite (or analyze) repository history git-filter-repo destructively rewrites history (unless --analyze or --dry-run are given) according to specified rules. It refuses to do any rewriting unless either run from a clean fresh clone, or --force was given. Basic Usage: git-filter-repo --analyze git-filter-repo [FILTER/RENAME/CONTROL OPTIONS] See EXAMPLES section for details.
es: Reescribir (o analizar) el historial del repositorio git-filter-repo reescribe destructivamente el historial (a menos que se use --analyze o --dry-run) según las reglas especificadas. Se niega a hacer cualquier reescritura a menos que se ejecute desde un clon limpio y fresco, o se haya dado --force. Uso básico: git-filter-repo --analyze git-filter-repo [OPCIONES DE FILTRO/RENOMBRADO/CONTROL] Consulte la sección de EJEMPLOS para más detalles.

source: CALLBACKS Most callback functions are of the same general format. For a command line argument like --foo-callback 'BODY' the following code will be compiled and called: def foo_callback(foo): BODY The exception on callbacks is the --file-info-callback, which will be discussed further below. Given the callback style, we can thus make a simple callback to replace 'Jon' with 'John' in author/committer/tagger names: git filter-repo --name-callback 'return name.replace(b"Jon", b"John")' To remove all 'Tested-by' tags in commit (or tag) messages: git filter-repo --message-callback 'return re.sub(br"\nTested-by:.*", "", message)' To remove all .DS_Store files: git filter-repo --filename-callback 'return None if os.path.basename(filename) == b".DS_Store" else filename' Note that if BODY resolves to a filename, then the contents of that file will be used as the BODY in the callback function. The --file-info-callback has a more involved function callback; for it the following code will be compiled and called: def file_info_callback(filename, mode, blob_id, value): BODY It is designed to be used in cases where filtering depends on both filename and contents (and maybe mode). It is called for file changes other than deletions (since deletions have no file contents to operate on). This callback is expected to return a tuple of (filename, mode, blob_id). It can make use of the following functions from the value instance: value.get_contents_by_identifier(blob_id) -> contents (bytestring) value.get_size_by_identifier(blob_id) -> size_of_blob (int) value.insert_file_with_contents(contents) -> blob_id value.is_binary(contents) -> bool value.apply_replace_text(contents) -> new_contents (bytestring) and can read/write the following data member from the value instance: value.data (dict) The filename can be used for renaming the file similar to --filename-callback (or None to drop the change), and mode is one of b'100644', b'100755', b'120000', or b'160000'. For more detailed examples and explanations AND caveats, see https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#CALLBACKS EXAMPLES To get a bunch of reports mentioning renames that have occurred in your repo and listing sizes of objects aggregated by any of path, directory, extension, or blob-id: git filter-repo --analyze (These reports can help you choose how to filter your repo; it can be useful to re-run this command after filtering to regenerate the report and verify the changes look correct.) To extract the history that touched just 'guides' and 'tools/releases': git filter-repo --path guides/ --path tools/releases To remove foo.zip and bar/baz/zips from every revision in history: git filter-repo --path foo.zip --path bar/baz/zips/ --invert-paths To replace the text 'password' with 'p455w0rd': git filter-repo --replace-text <(echo "password==>p455w0rd") To use the current version of the .mailmap file to update authors, committers, and taggers throughout history and make it permanent: git filter-repo --use-mailmap To extract the history of 'src/', rename all files to have a new leading directory 'my-module' (e.g. src/foo.java -> my-module/src/foo.java), and add a 'my-module-' prefix to all tags: git filter-repo --path src/ --to-subdirectory-filter my-module --tag-rename '':'my-module-' For more detailed examples and explanations, see https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#EXAMPLES
es: RETROCESOS La mayoría de las funciones de retroceso tienen el mismo formato general. Para un argumento de línea de comandos como --foo-callback 'CUERPO' se compilará y llamará el siguiente código: def foo_callback(foo): CUERPO La excepción en los retrocesos es el --file-info-callback, que se discutirá más adelante. Dado el estilo de retroceso, podemos hacer un retroceso simple para reemplazar 'Jon' por 'John' en nombres de autor/committers/etiquetadores: git filter-repo --name-callback 'return name.replace(b"Jon", b"John")' Para eliminar todas las etiquetas 'Tested-by' en mensajes de commit (o etiqueta): git filter-repo --message-callback 'return re.sub(br"\nTested-by:.*", "", message)' Para eliminar todos los archivos .DS_Store: git filter-repo --filename-callback 'return None if os.path.basename(filename) == b".DS_Store" else filename' Tenga en cuenta que si CUERPO se resuelve en un nombre de archivo, entonces el contenido de ese archivo se usará como el CUERPO en la función de retroceso. El --file-info-callback tiene una función de retroceso más compleja; para él se compilará y llamará el siguiente código: def file_info_callback(filename, mode, blob_id, value): CUERPO Está diseñado para usarse en casos donde el filtrado depende tanto del nombre de archivo como del contenido (y tal vez del modo). Se llama para cambios de archivo que no sean eliminaciones (ya que las eliminaciones no tienen contenido de archivo para operar). Se espera que este retroceso devuelva una tupla de (nombre de archivo, modo, blob_id). Puede hacer uso de las siguientes funciones de la instancia value: value.get_contents_by_identifier(blob_id) -> contenido (cadena de bytes) value.get_size_by_identifier(blob_id) -> tamaño_del_blob (int) value.insert_file_with_contents(contents) -> blob_id value.is_binary(contents) -> bool value.apply_replace_text(contents) -> nuevo_contenido (cadena de bytes) y puede leer/escribir el siguiente miembro de datos de la instancia value: value.data (dict) El nombre de archivo puede usarse para renombrar el archivo de manera similar a --filename-callback (o None para descartar el cambio), y el modo es uno de b'100644', b'100755', b'120000' o b'160000'. Para ejemplos y explicaciones más detalladas Y advertencias, vea https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#CALLBACKS EJEMPLOS Para obtener un montón de informes que mencionan renombramientos que han ocurrido en su repositorio y listando tamaños de objetos agregados por cualquiera de ruta, directorio, extensión o blob-id: git filter-repo --analyze (Estos informes pueden ayudarle a elegir cómo filtrar su repositorio; puede ser útil ejecutar este comando nuevamente después de filtrar para regenerar el informe y verificar que los cambios sean correctos.) Para extraer el historial que tocó solo 'guides' y 'tools/releases': git filter-repo --path guides/ --path tools/releases Para eliminar foo.zip y bar/baz/zips de cada revisión en la historia: git filter-repo --path foo.zip --path bar/baz/zips/ --invert-paths Para reemplazar el texto 'password' con 'p455w0rd': git filter-repo --replace-text <(echo "password==>p455w0rd") Para usar la versión actual del archivo .mailmap para actualizar autores, committers y etiquetadores a lo largo de la historia y hacerlo permanente: git filter-repo --use-mailmap Para extraer la historia de 'src/', renombrar todos los archivos para que tengan un nuevo directorio principal 'my-module' (por ejemplo, src/foo.java -> my-module/src/foo.java), y agregar un prefijo 'my-module-' a todas las etiquetas: git filter-repo --path src/ --to-subdirectory-filter my-module --tag-rename '':'my-module-' Para ejemplos y explicaciones más detalladas, vea https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#EXAMPLES

source: Analysis
es: Análisis

source: Analyze repository history and create a report that may be useful in determining what to filter in a subsequent run. Will not modify your repo.
es: Analiza el historial del repositorio y crea un informe que puede ser útil para determinar qué filtrar en una ejecución posterior. No modificará tu repositorio.

source: Directory to write report, defaults to GIT_DIR/filter_repo/analysis,refuses to run if exists, --force delete existing dir first.
es: Directorio para escribir el informe, por defecto GIT_DIR/filter_repo/analysis, se niega a ejecutarse si existe, --force elimina primero el directorio existente.

source: Filtering based on paths (see also --filename-callback)
es: Filtrado basado en rutas (ver también --filename-callback)

source: These options specify the paths to select. Note that much like git itself, renames are NOT followed so you may need to specify multiple paths, e.g. `--path olddir/ --path newdir/`
es: Estas opciones especifican las rutas a seleccionar. Ten en cuenta que, al igual que git mismo, los cambios de nombre NO se siguen, por lo que puede que necesites especificar múltiples rutas, por ejemplo `--path olddir/ --path newdir/`

source: Invert the selection of files from the specified --path-{match,glob,regex} options below, i.e. only select files matching none of those options.
es: Invierte la selección de archivos de las opciones --path-{match,glob,regex} especificadas abajo, es decir, solo selecciona archivos que no coincidan con ninguna de esas opciones.
