Repository: samuelAriza/HireLoop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Currency
es: Moneda

source: ISO 4217 currency code (e.g., usd, eur).
es: Código de moneda ISO 4217 (ej: usd, eur).

source: Current status of the payment.
es: Estado actual del pago.

source: When the payment record was created.
es: Cuándo se creó el registro de pago.

source: Last time the payment status was updated.
es: Última vez que se actualizó el estado del pago.

source: Payment
es: Pago

source: Payments
es: Pagos

source: Payment {id} - {status} (${amount} {currency})
es: Pago {id} - {status} (${amount} {currency})

source: Payment Canceled
es: Pago Cancelado

source: The payment process was canceled. No charges were made.
es: El proceso de pago fue cancelado. No se realizaron cargos.

source: You can try again whenever you’re ready.
es: Puede intentarlo de nuevo cuando esté listo.

source: Back to Home
es: Volver al Inicio

source: View Cart
es: Ver Carrito

source: Payment Successful
es: Pago Exitoso

source: Payment Successful!
es: ¡Pago Exitoso!

source: Thank you for your purchase. Your order has been confirmed and your cart is now empty.
es: Gracias por su compra. Su pedido ha sido confirmado y su carrito ahora está vacío.

source: Browse Services
es: Explorar Servicios

source: View Orders
es: Ver Pedidos

source: Authentication required.
es: Se requiere autenticación.

source: Your cart is empty.
es: Tu carrito está vacío.

source: Invalid item in cart.
es: Artículo inválido en el carrito.

source: Cart total must be greater than zero.
es: El total del carrito debe ser mayor a cero.

source: Payment processing failed. Please try again.
es: Error al procesar el pago. Por favor intenta de nuevo.

source: You must be logged in to view this page.
es: Debes iniciar sesión para ver esta página.

source: Payment was not completed.
es: El pago no se completó.

source: Could not verify payment. Please contact support.
es: No se pudo verificar el pago. Por favor contacta a soporte.

source: No pending payment found.
es: No se encontró ningún pago pendiente.

source: Payment successful! Your order is confirmed.
es: ¡Pago exitoso! Tu pedido está confirmado.

source: Payment was canceled. Your cart has been preserved.
es: El pago fue cancelado. Tu carrito se ha preservado.

source: Project Image
es: Imagen del Proyecto

source: Optional. Upload a relevant image (JPEG, PNG, GIF). Max 5MB.
es: Opcional. Sube una imagen relevante (JPEG, PNG, GIF). Máximo 5MB.

source: Project Title
es: Título del Proyecto

source: Budget (USD)
es: Presupuesto (USD)

source: A clear and descriptive title for your project.
es: Un título claro y descriptivo para tu proyecto.

source: Explain what you need, requirements, and deliverables.
es: Explica lo que necesitas, requisitos y entregables.

source: Total budget in USD. This is the maximum you’re willing to pay.
es: Presupuesto total en USD. Este es el máximo que está dispuesto a pagar.

source: e.g., Build a responsive website
es: ej: Construir un sitio web responsivo

source: Detailed project description...
es: Descripción detallada del proyecto...

source: Update Project Image
es: Actualizar Imagen del Proyecto

source: Optional. Upload a new image to replace the current one.
es: Opcional. Sube una nueva imagen para reemplazar la actual.

source: Role
es: Rol

source: Agreed Payment (USD)
es: Pago Acordado (USD)

source: e.g., Frontend Developer
es: ej: Desarrollador Frontend

source: Agreed payment cannot exceed the project's total budget of $%(budget)s.
es: El pago acordado no puede exceder el presupuesto total del proyecto de $%(budget)s.

source: Cannot update payment. Available budget: $%(available)s
es: No se puede actualizar el pago. Presupuesto disponible: $%(available)s

source: Cover Letter
es: Carta de Presentación

source: Proposed Payment (USD)
es: Pago Propuesto (USD)

source: Explain why you're the best fit for this project.
es: Explica por qué eres el mejor candidato para este proyecto.

source: Your proposed compensation for completing the work.
es: Tu compensación propuesta por completar el trabajo.

source: Tell us about your experience...
es: Cuéntanos sobre tu experiencia...

source: Your proposal exceeds the project budget of $%(budget)s.
es: Su propuesta excede el presupuesto del proyecto de $%(budget)s.

source: In Progress
es: En Progreso

source: Delivered
es: Entregado

source: client
es: cliente

source: title
es: título

source: description
es: descripción

source: status
es: estado

source: budget
es: presupuesto

source: image path
es: ruta de imagen

source: created at
es: creado el

source: updated at
es: actualizado el

source: project
es: proyecto

source: projects
es: proyectos

source: Invited
es: Invitado

source: Accepted
es: Aceptado

source: Rejected
es: Rechazado

source: Removed
es: Eliminado

source: role
es: rol

source: agreed payment
es: pago acordado

source: project assignment
es: asignación de proyecto

source: project assignments
es: asignaciones de proyecto

source: Withdrawn
es: Retirado

source: cover letter
es: carta de presentación

source: proposed payment
es: pago propuesto

source: project application
es: aplicación de proyecto

source: project applications
es: aplicaciones de proyecto

source: Already applied to this project.
es: Ya aplicaste a este proyecto.

source: Application not found
es: Aplicación no encontrada

source: Project not found
es: Proyecto no encontrado

source: Freelancer already registered or assigned to this project.
es: Freelancer ya registrado o asignado a este proyecto.

source: Assignment not found
es: Asignación no encontrada

source: Not enough budget for this assignment
es: No hay suficiente presupuesto para esta asignación

source: Project Detail
es: Detalle del Proyecto

source: Apply to Project
es: Aplicar al Proyecto

source: Apply to %(title)s
es: Postularse a %(title)s

source: Submit Application
es: Enviar Aplicación

source: Tips for a Strong Application
es: Consejos para una Aplicación Sólida

source: Be concise and professional
es: Sé conciso y profesional

source: Highlight relevant experience
es: Destaca experiencia relevante

source: Show enthusiasm for the project
es: Muestra entusiasmo por el proyecto

source: Offer a fair and realistic amount
es: Ofrece un monto justo y realista

source: Justify your rate briefly
es: Justifica tu tarifa brevemente

source: Be transparent with costs
es: Sé transparente con los costos

source: Edit Assignment
es: Editar Asignación

source: Assign Freelancer
es: Asignar Freelancer

source: Update Assignment
es: Actualizar Asignación

source: Create Assignment
es: Crear Asignación

source: Tips for Assignments
es: Consejos para Asignaciones

source: Fair Payment
es: Pago Justo

source: Ensure payment fits within budget
es: Asegúrate de que el pago esté dentro del presupuesto

source: Offer transparency with freelancers
es: Ofrece transparencia con los freelancers

source: Keep negotiation records
es: Mantén registros de negociación

source: Clear Roles
es: Roles Claros

source: Define roles explicitly
es: Define roles explícitamente

source: Match skills to tasks
es: Relaciona habilidades con tareas

source: Set measurable deliverables
es: Establece entregables medibles

source: My Projects
es: Mis Proyectos

source: Create Project
es: Crear Proyecto

source: You haven't created any projects
es: No has creado ningún proyecto

source: Start by creating your first project to hire freelancers!
es: ¡Comienza creando tu primer proyecto para contratar freelancers!

source: Create My First Project
es: Crear Mi Primer Proyecto

source: Projects
es: Proyectos

source: ago
es: hace

source: Deadline
es: Fecha límite

source: %(counter)s freelancer applied
es: %(counter)s freelancer aplicó

source: Freelancer Applications
es: Aplicaciones de Freelancers

source: Applied
es: Aplicado

source: Accept
es: Aceptar

source: Reject
es: Rechazar

source: No applications yet.
es: Aún no hay aplicaciones.

source: You have already applied to this project.
es: Ya has aplicado a este proyecto.

source: This project is not accepting new applications.
es: Este proyecto no está aceptando nuevas aplicaciones.

source: Create a freelancer profile
es: Crear un perfil de freelancer

source: to apply to this project.
es: para aplicar a este proyecto.

source: Log in
es: Iniciar sesión

source: Edit Project
es: Editar Proyecto

source: Update Project
es: Actualizar Proyecto

source: Create New Project
es: Crear Nuevo Proyecto

source: Tips for a Great Project
es: Consejos para un Gran Proyecto

source: Clear Scope
es: Alcance Claro

source: Define deliverables clearly
es: Define los entregables claramente

source: Add realistic deadlines
es: Añade plazos realistas

source: Include success criteria
es: Incluye criterios de éxito

source: Budgeting
es: Presupuesto

source: Allocate enough budget for quality
es: Asigna suficiente presupuesto para calidad

source: Be transparent with freelancers
es: Sé transparente con los freelancers

source: Keep contingency in mind
es: Ten en cuenta contingencias

source: Available Projects
es: Proyectos Disponibles

source: Apply
es: Aplicar

source: Already Applied
es: Ya Aplicado

source: No projects found
es: No se encontraron proyectos

source: Currently, no projects are available.
es: Actualmente, no hay proyectos disponibles.

source: Projects pagination
es: Paginación de proyectos

source: HireLoop Logo
es: Logo de HireLoop

source: Browse MicroServices
es: Explorar Microservicios

source: Mentorships
es: Mentorías

source: Dashboard
es: Panel

source: Cart
es: Carrito

source: Connecting freelancers with clients and mentors worldwide.
es: Conectando freelancers con clientes y mentores alrededor del mundo.

source: Services
es: Servicios

source: Freelance Services
es: Servicios Freelance

source: Quick Links
es: Enlaces Rápidos

source: About Us
es: Acerca de Nosotros

source: Contact
es: Contacto

source: Privacy Policy
es: Política de Privacidad

source: Terms of Service
es: Términos de Servicio

source: All rights reserved.
es: Todos los derechos reservados.

source: {editor}: Editing failed
es: {editor}: Edición fallida

source: {editor}: Editing failed: {e}
es: {editor}: Edición fallida: {e}

source: Options
es: Opciones

source: Got unexpected extra argument ({args})
es: Se recibió un argumento extra inesperado ({args})

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
es: Advertencia de desaprobación: El comando {name!r} está desaprobado.{extra_message}

source: Aborted!
es: ¡Abortado!

source: Commands
es: Comandos

source: Missing command.
es: Comando faltante.

source: No such command {name!r}.
es: No existe el comando {name!r}.

source: Value must be an iterable.
es: El valor debe ser un iterable.

source: Takes {nargs} values but 1 was given.
es: Toma {nargs} valores pero se dio 1.

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
es: Advertencia de desaprobación: El {param_type} {name!r} está desaprobado.{extra_message}

source: env var: {var}
es: var de entorno: {var}

source: default: {default}
es: predeterminado: {default}

source: (dynamic)
es: (dinámico)

source: %(prog)s, version %(version)s
es: %(prog)s, versión %(version)s

source: Show the version and exit.
es: Mostrar la versión y salir.

source: Show this message and exit.
es: Mostrar este mensaje y salir.

source: Try '{command} {option}' for help.
es: Pruebe '{command} {option}' para ayuda.

source: Invalid value: {message}
es: Valor inválido: {message}

source: Invalid value for {param_hint}: {message}
es: Valor inválido para {param_hint}: {message}

source: Missing argument
es: Argumento faltante

source: Missing option
es: Opción faltante

source: Missing parameter
es: Parámetro faltante

source: Missing {param_type}
es: Falta {param_type}

source: Missing parameter: {param_name}
es: Parámetro faltante: {param_name}

source: No such option: {name}
es: No existe la opción: {name}

source: Did you mean {possibility}?
es: ¿Quiso decir {possibility}?

source: unknown error
es: error desconocido

source: Could not open file {filename!r}: {message}
es: No se pudo abrir el archivo {filename!r}: {message}

source: Usage:
es: Uso:

source: Argument {name!r} takes {nargs} values.
es: El argumento {name!r} toma {nargs} valores.

source: Option {name!r} does not take a value.
es: La opción {name!r} no acepta un valor.

source: Option {name!r} requires an argument.
es: La opción {name!r} requiere un argumento.

source: Shell completion is not supported for Bash versions older than 4.4.
es: La finalización de shell no es compatible con versiones de Bash anteriores a la 4.4.

source: Couldn't detect Bash version, shell completion is not supported.
es: No se pudo detectar la versión de Bash, la finalización de shell no es compatible.

source: Repeat for confirmation
es: Repetir para confirmar

source: Error: The value you entered was invalid.
es: Error: El valor que ingresó no es válido.

source: Error: The two entered values do not match.
es: Error: Los dos valores ingresados no coinciden.

source: Error: invalid input
es: Error: entrada no válida

source: Press any key to continue...
es: Presione cualquier tecla para continuar...

source: Choose from: {choices}
es: Elija de: {choices}

source: {value!r} is not {choice}.
es: {value!r} no es {choice}.

source: {value!r} does not match the format {format}.
es: {value!r} no coincide con el formato {format}.

source: {value!r} is not a valid {number_type}.
es: {value!r} no es un {number_type} válido.

source: {value} is not in the range {range}.
es: {value} no está en el rango {range}.

source: {value!r} is not a valid boolean. Recognized values: {states}
es: {value!r} no es un booleano válido. Valores reconocidos: {states}

source: {value!r} is not a valid UUID.
es: {value!r} no es un UUID válido.

source: file
es: archivo

source: directory
es: directorio

source: path
es: ruta

source: {name} {filename!r} does not exist.
es: {name} {filename!r} no existe.

source: {name} {filename!r} is a file.
es: {name} {filename!r} es un archivo.

source: {name} {filename!r} is a directory.
es: {name} {filename!r} es un directorio.

source: {name} {filename!r} is not readable.
es: {name} {filename!r} no es legible.

source: {name} {filename!r} is not writable.
es: {name} {filename!r} no es escribible.

source: {name} {filename!r} is not executable.
es: {name} {filename!r} no es ejecutable.

source: {len_type} values are required, but {len_value} was given.
es: Se requieren valores de {len_type}, pero se proporcionaron {len_value}.

source: Messages
es: Mensajes

source: Site Maps
es: Mapas del sitio

source: Static Files
es: Archivos estáticos

source: Syndication
es: Sindicación

source: That page number is not an integer
es: Ese número de página no es un entero

source: That page number is less than 1
es: Ese número de página es menor que 1

source: That page contains no results
es: Esa página no contiene resultados

source: Enter a valid value.
es: Introduzca un valor válido.

source: Enter a valid domain name.
es: Introduzca un nombre de dominio válido.

source: Enter a valid URL.
es: Introduzca una URL válida.

source: Enter a valid integer.
es: Introduzca un entero válido.

source: Enter a valid email address.
es: Introduzca una dirección de correo electrónico válida.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
es: Introduzca un “slug” válido que consista en letras, números, guiones bajos o guiones.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
es: Introduzca un “slug” válido que consista en letras Unicode, números, guiones bajos o guiones.

source: Enter a valid %(protocol)s address.
es: Introduzca una dirección %(protocol)s válida.

source: IPv4 or IPv6
es: IPv4 o IPv6

source: Enter only digits separated by commas.
es: Introduzca solo dígitos separados por comas.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
es: Asegúrese de que este valor sea %(limit_value)s (es %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
es: Asegúrese de que este valor sea menor o igual a %(limit_value)s.

source: Ensure this value is greater than or equal to %(limit_value)s.
es: Asegúrese de que este valor sea mayor o igual a %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s.
es: Asegúrese de que este valor sea un múltiplo del tamaño de paso %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
es: Asegúrese de que este valor sea un múltiplo del tamaño de paso %(limit_value)s, comenzando desde %(offset)s, por ejemplo %(offset)s, %(valid_value1)s, %(valid_value2)s, y así sucesivamente.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
es: Asegúrese de que este valor tenga al menos %(limit_value)d carácter (tiene %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
es: Asegúrese de que este valor tenga como máximo %(limit_value)d carácter (tiene %(show_value)d).

source: Enter a number.
es: Introduzca un número.

source: Ensure that there are no more than %(max)s digit in total.
es: Asegúrese de que no haya más de %(max)s dígitos en total.

source: Ensure that there are no more than %(max)s decimal place.
es: Asegúrese de que no haya más de %(max)s decimales.

source: Ensure that there are no more than %(max)s digit before the decimal point.
es: Asegúrese de que no haya más de %(max)s dígitos antes del punto decimal.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
es: La extensión de archivo “%(extension)s” no está permitida. Las extensiones permitidas son: %(allowed_extensions)s.

source: Null characters are not allowed.
es: No se permiten caracteres nulos.

source: and
es: y

source: %(model_name)s with this %(field_labels)s already exists.
es: %(model_name)s con este %(field_labels)s ya existe.

source: Constraint “%(name)s” is violated.
es: Se ha violado la restricción “%(name)s”.

source: Value %(value)r is not a valid choice.
es: El valor %(value)r no es una opción válida.

source: This field cannot be null.
es: Este campo no puede ser nulo.

source: This field cannot be blank.
es: Este campo no puede estar vacío.

source: %(model_name)s with this %(field_label)s already exists.
es: %(model_name)s con este %(field_label)s ya existe.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
es: %(field_label)s debe ser único para %(date_field_label)s %(lookup_type)s.

source: Field of type: %(field_type)s
es: Campo de tipo: %(field_type)s

source: “%(value)s” value must be either True or False.
es: El valor “%(value)s” debe ser True o False.

source: “%(value)s” value must be either True, False, or None.
es: El valor “%(value)s” debe ser True, False o None.

source: Boolean (Either True or False)
es: Booleano (True o False)

source: String (up to %(max_length)s)
es: Cadena (hasta %(max_length)s)

source: String (unlimited)
es: Cadena (ilimitada)

source: Comma-separated integers
es: Enteros separados por comas

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
es: El valor “%(value)s” tiene un formato de fecha inválido. Debe estar en formato AAAA-MM-DD.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
es: El valor “%(value)s” tiene el formato correcto (AAAA-MM-DD) pero es una fecha inválida.

source: Date (without time)
es: Fecha (sin hora)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
es: El valor “%(value)s” tiene un formato inválido. Debe estar en formato AAAA-MM-DD HH:MM[:ss[.uuuuuu]][TZ].

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
es: El valor “%(value)s” tiene el formato correcto (AAAA-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) pero es una fecha/hora inválida.

source: Date (with time)
es: Fecha (con hora)

source: “%(value)s” value must be a decimal number.
es: El valor “%(value)s” debe ser un número decimal.

source: Decimal number
es: Número decimal

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
es: El valor “%(value)s” tiene un formato inválido. Debe estar en formato [DD] [[HH:]MM:]ss[.uuuuuu].

source: Email address
es: Dirección de correo electrónico

source: File path
es: Ruta de archivo

source: “%(value)s” value must be a float.
es: El valor “%(value)s” debe ser un número de punto flotante.

source: Floating point number
es: Número de punto flotante

source: “%(value)s” value must be an integer.
es: El valor “%(value)s” debe ser un número entero.

source: Integer
es: Número entero

source: Big (8 byte) integer
es: Número entero grande (8 bytes)

source: Small integer
es: Número entero pequeño

source: IPv4 address
es: Dirección IPv4

source: IP address
es: Dirección IP

source: “%(value)s” value must be either None, True or False.
es: El valor “%(value)s” debe ser None, True o False.

source: Boolean (Either True, False or None)
es: Booleano (True, False o None)

source: Positive big integer
es: Número entero grande positivo

source: Positive integer
es: Número entero positivo

source: Positive small integer
es: Número entero pequeño positivo

source: Slug (up to %(max_length)s)
es: Slug (hasta %(max_length)s)

source: Text
es: Texto

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
es: El valor “%(value)s” tiene un formato inválido. Debe estar en formato HH:MM[:ss[.uuuuuu]].

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
es: El valor “%(value)s” tiene el formato correcto (HH:MM[:ss[.uuuuuu]]) pero es una hora inválida.

source: Time
es: Hora

source: Raw binary data
es: Datos binarios sin procesar

source: “%(value)s” is not a valid UUID.
es: “%(value)s” no es un UUID válido.

source: Universally unique identifier
es: Identificador único universal

source: File
es: Archivo

source: A JSON object
es: Un objeto JSON

source: Value must be valid JSON.
es: El valor debe ser un JSON válido.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
es: La instancia %(model)s con %(field)s %(value)r no es una opción válida.

source: Foreign Key (type determined by related field)
es: Clave foránea (tipo determinado por el campo relacionado)

source: One-to-one relationship
es: Relación uno a uno

source: %(from)s-%(to)s relationship
es: Relación %(from)s-%(to)s

source: %(from)s-%(to)s relationships
es: Relaciones %(from)s-%(to)s

source: Many-to-many relationship
es: Relación muchos a muchos

source: This field is required.
es: Este campo es obligatorio.

source: Enter a whole number.
es: Introduzca un número entero.

source: Enter a valid date.
es: Introduzca una fecha válida.

source: Enter a valid time.
es: Introduzca una hora válida.

source: Enter a valid date/time.
es: Introduzca una fecha/hora válida.

source: Enter a valid duration.
es: Introduzca una duración válida.

source: The number of days must be between {min_days} and {max_days}.
es: El número de días debe estar entre {min_days} y {max_days}.

source: No file was submitted. Check the encoding type on the form.
es: No se envió ningún archivo. Verifique el tipo de codificación en el formulario.

source: No file was submitted.
es: No se envió ningún archivo.

source: The submitted file is empty.
es: El archivo enviado está vacío.
